dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/pio.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_LSR_OFFSET                      (0xC4)                                        /**<  (PIO_LSR) Level Select Register  Offset */

#define PIO_LSR_P0_Pos                      0                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P0_Msk                      (_U_(0x1) << PIO_LSR_P0_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P0                          PIO_LSR_P0_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P0_Msk instead */
#define PIO_LSR_P1_Pos                      1                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P1_Msk                      (_U_(0x1) << PIO_LSR_P1_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P1                          PIO_LSR_P1_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P1_Msk instead */
#define PIO_LSR_P2_Pos                      2                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P2_Msk                      (_U_(0x1) << PIO_LSR_P2_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P2                          PIO_LSR_P2_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P2_Msk instead */
#define PIO_LSR_P3_Pos                      3                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P3_Msk                      (_U_(0x1) << PIO_LSR_P3_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P3                          PIO_LSR_P3_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P3_Msk instead */
#define PIO_LSR_P4_Pos                      4                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P4_Msk                      (_U_(0x1) << PIO_LSR_P4_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P4                          PIO_LSR_P4_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P4_Msk instead */
#define PIO_LSR_P5_Pos                      5                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P5_Msk                      (_U_(0x1) << PIO_LSR_P5_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P5                          PIO_LSR_P5_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P5_Msk instead */
#define PIO_LSR_P6_Pos                      6                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P6_Msk                      (_U_(0x1) << PIO_LSR_P6_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P6                          PIO_LSR_P6_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P6_Msk instead */
#define PIO_LSR_P7_Pos                      7                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P7_Msk                      (_U_(0x1) << PIO_LSR_P7_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P7                          PIO_LSR_P7_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P7_Msk instead */
#define PIO_LSR_P8_Pos                      8                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P8_Msk                      (_U_(0x1) << PIO_LSR_P8_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P8                          PIO_LSR_P8_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P8_Msk instead */
#define PIO_LSR_P9_Pos                      9                                              /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P9_Msk                      (_U_(0x1) << PIO_LSR_P9_Pos)                   /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P9                          PIO_LSR_P9_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P9_Msk instead */
#define PIO_LSR_P10_Pos                     10                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P10_Msk                     (_U_(0x1) << PIO_LSR_P10_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P10                         PIO_LSR_P10_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P10_Msk instead */
#define PIO_LSR_P11_Pos                     11                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P11_Msk                     (_U_(0x1) << PIO_LSR_P11_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P11                         PIO_LSR_P11_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P11_Msk instead */
#define PIO_LSR_P12_Pos                     12                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P12_Msk                     (_U_(0x1) << PIO_LSR_P12_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P12                         PIO_LSR_P12_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P12_Msk instead */
#define PIO_LSR_P13_Pos                     13                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P13_Msk                     (_U_(0x1) << PIO_LSR_P13_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P13                         PIO_LSR_P13_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P13_Msk instead */
#define PIO_LSR_P14_Pos                     14                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P14_Msk                     (_U_(0x1) << PIO_LSR_P14_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P14                         PIO_LSR_P14_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P14_Msk instead */
#define PIO_LSR_P15_Pos                     15                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P15_Msk                     (_U_(0x1) << PIO_LSR_P15_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P15                         PIO_LSR_P15_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P15_Msk instead */
#define PIO_LSR_P16_Pos                     16                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P16_Msk                     (_U_(0x1) << PIO_LSR_P16_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P16                         PIO_LSR_P16_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P16_Msk instead */
#define PIO_LSR_P17_Pos                     17                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P17_Msk                     (_U_(0x1) << PIO_LSR_P17_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P17                         PIO_LSR_P17_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P17_Msk instead */
#define PIO_LSR_P18_Pos                     18                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P18_Msk                     (_U_(0x1) << PIO_LSR_P18_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P18                         PIO_LSR_P18_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P18_Msk instead */
#define PIO_LSR_P19_Pos                     19                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P19_Msk                     (_U_(0x1) << PIO_LSR_P19_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P19                         PIO_LSR_P19_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P19_Msk instead */
#define PIO_LSR_P20_Pos                     20                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P20_Msk                     (_U_(0x1) << PIO_LSR_P20_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P20                         PIO_LSR_P20_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P20_Msk instead */
#define PIO_LSR_P21_Pos                     21                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P21_Msk                     (_U_(0x1) << PIO_LSR_P21_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P21                         PIO_LSR_P21_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P21_Msk instead */
#define PIO_LSR_P22_Pos                     22                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P22_Msk                     (_U_(0x1) << PIO_LSR_P22_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P22                         PIO_LSR_P22_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P22_Msk instead */
#define PIO_LSR_P23_Pos                     23                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P23_Msk                     (_U_(0x1) << PIO_LSR_P23_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P23                         PIO_LSR_P23_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P23_Msk instead */
#define PIO_LSR_P24_Pos                     24                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P24_Msk                     (_U_(0x1) << PIO_LSR_P24_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P24                         PIO_LSR_P24_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P24_Msk instead */
#define PIO_LSR_P25_Pos                     25                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P25_Msk                     (_U_(0x1) << PIO_LSR_P25_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P25                         PIO_LSR_P25_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P25_Msk instead */
#define PIO_LSR_P26_Pos                     26                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P26_Msk                     (_U_(0x1) << PIO_LSR_P26_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P26                         PIO_LSR_P26_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P26_Msk instead */
#define PIO_LSR_P27_Pos                     27                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P27_Msk                     (_U_(0x1) << PIO_LSR_P27_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P27                         PIO_LSR_P27_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P27_Msk instead */
#define PIO_LSR_P28_Pos                     28                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P28_Msk                     (_U_(0x1) << PIO_LSR_P28_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P28                         PIO_LSR_P28_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P28_Msk instead */
#define PIO_LSR_P29_Pos                     29                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P29_Msk                     (_U_(0x1) << PIO_LSR_P29_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P29                         PIO_LSR_P29_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P29_Msk instead */
#define PIO_LSR_P30_Pos                     30                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P30_Msk                     (_U_(0x1) << PIO_LSR_P30_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P30                         PIO_LSR_P30_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P30_Msk instead */
#define PIO_LSR_P31_Pos                     31                                             /**< (PIO_LSR) Level Interrupt Selection Position */
#define PIO_LSR_P31_Msk                     (_U_(0x1) << PIO_LSR_P31_Pos)                  /**< (PIO_LSR) Level Interrupt Selection Mask */
#define PIO_LSR_P31                         PIO_LSR_P31_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_LSR_P31_Msk instead */
#define PIO_LSR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_LSR) Register MASK  (Use PIO_LSR_Msk instead)  */
#define PIO_LSR_Msk                         _U_(0xFFFFFFFF)                                /**< (PIO_LSR) Register Mask  */

#define PIO_LSR_P_Pos                       0                                              /**< (PIO_LSR Position) Level Interrupt Selection */
#define PIO_LSR_P_Msk                       (_U_(0xFFFFFFFF) << PIO_LSR_P_Pos)             /**< (PIO_LSR Mask) P */
#define PIO_LSR_P(value)                    (PIO_LSR_P_Msk & ((value) << PIO_LSR_P_Pos))   

/* -------- PIO_ELSR : (PIO Offset: 0xc8) (R/ 32) Edge/Level Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Edge/Level Interrupt Source Selection    */
    uint32_t P1:1;                      /**< bit:      1  Edge/Level Interrupt Source Selection    */
    uint32_t P2:1;                      /**< bit:      2  Edge/Level Interrupt Source Selection    */
    uint32_t P3:1;                      /**< bit:      3  Edge/Level Interrupt Source Selection    */
    uint32_t P4:1;                      /**< bit:      4  Edge/Level Interrupt Source Selection    */
    uint32_t P5:1;                      /**< bit:      5  Edge/Level Interrupt Source Selection    */
    uint32_t P6:1;                      /**< bit:      6  Edge/Level Interrupt Source Selection    */
    uint32_t P7:1;                      /**< bit:      7  Edge/Level Interrupt Source Selection    */
    uint32_t P8:1;                      /**< bit:      8  Edge/Level Interrupt Source Selection    */
    uint32_t P9:1;                      /**< bit:      9  Edge/Level Interrupt Source Selection    */
    uint32_t P10:1;                     /**< bit:     10  Edge/Level Interrupt Source Selection    */
    uint32_t P11:1;                     /**< bit:     11  Edge/Level Interrupt Source Selection    */
    uint32_t P12:1;                     /**< bit:     12  Edge/Level Interrupt Source Selection    */
    uint32_t P13:1;                     /**< bit:     13  Edge/Level Interrupt Source Selection    */
    uint32_t P14:1;                     /**< bit:     14  Edge/Level Interrupt Source Selection    */
    uint32_t P15:1;                     /**< bit:     15  Edge/Level Interrupt Source Selection    */
    uint32_t P16:1;                     /**< bit:     16  Edge/Level Interrupt Source Selection    */
    uint32_t P17:1;                     /**< bit:     17  Edge/Level Interrupt Source Selection    */
    uint32_t P18:1;                     /**< bit:     18  Edge/Level Interrupt Source Selection    */
    uint32_t P19:1;                     /**< bit:     19  Edge/Level Interrupt Source Selection    */
    uint32_t P20:1;                     /**< bit:     20  Edge/Level Interrupt Source Selection    */
    uint32_t P21:1;                     /**< bit:     21  Edge/Level Interrupt Source Selection    */
    uint32_t P22:1;                     /**< bit:     22  Edge/Level Interrupt Source Selection    */
    uint32_t P23:1;                     /**< bit:     23  Edge/Level Interrupt Source Selection    */
    uint32_t P24:1;                     /**< bit:     24  Edge/Level Interrupt Source Selection    */
    uint32_t P25:1;                     /**< bit:     25  Edge/Level Interrupt Source Selection    */
    uint32_t P26:1;                     /**< bit:     26  Edge/Level Interrupt Source Selection    */
    uint32_t P27:1;                     /**< bit:     27  Edge/Level Interrupt Source Selection    */
    uint32_t P28:1;                     /**< bit:     28  Edge/Level Interrupt Source Selection    */
    uint32_t P29:1;                     /**< bit:     29  Edge/Level Interrupt Source Selection    */
    uint32_t P30:1;                     /**< bit:     30  Edge/Level Interrupt Source Selection    */
    uint32_t P31:1;                     /**< bit:     31  Edge/Level Interrupt Source Selection    */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Edge/Level Interrupt Source Selection    */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_ELSR_Type;
